Repository: Git-Rocky-Stack/Agent-X
Catalog: src/AgentX.App/Strings/*/Resources.resw
Source language: en_us
Languages: de, es, fr, ja, zh_cn

# Cheatsheet_Dialog.Title
source: Keyboard Shortcuts
de: Tastenkombinationen
es: Atajos de teclado
fr: Raccourcis clavier
ja: キーボードショートカット
zh_cn: 键盘快捷键

# Plugin_Manager.Text
source: Plugins
de: Plugin-Verwaltung
fr: Gestionnaire de plugins
ja: プラグイン管理
zh_cn: 插件管理

# Plugin_Install.ToolTipService.ToolTip
source: Install plugin from file
de: Plugin installieren
es: Instalar plugin desde archivo
fr: Installer un plugin depuis un fichier
ja: ファイルからプラグインをインストール
zh_cn: 从文件安装插件

# Plugin_Refresh.ToolTipService.ToolTip
source: Refresh plugins
de: Plugins aktualisieren
es: Actualizar plugins
fr: Actualiser les plugins
ja: プラグインを更新
zh_cn: 刷新插件

# Plugin_Loading.Text
source: Loading plugins...
de: Plugins werden geladen...
es: Cargando plugins...
fr: Chargement des plugins...
ja: プラグインを読み込み中...
zh_cn: 正在加载插件...

# Plugin_NoPlugins.Text
source: No plugins installed
de: Keine Plugins installiert
es: No hay plugins instalados
fr: Aucun plugin installé
ja: プラグインはインストールされていません
zh_cn: 未安装插件

# Plugin_NoPluginsHint.Text
source: Install .agentx-plugin or .zip packages to extend Agent-X.
de: .agentx-plugin- oder .zip-Pakete installieren, um Agent-X zu erweitern.
es: Instala paquetes .agentx-plugin o .zip para extender Agent-X.
fr: Installez des paquets .agentx-plugin ou .zip pour étendre Agent-X.
ja: .agentx-pluginまたは.zipパッケージをインストールしてAgent-Xを拡張します。
zh_cn: 安装 .agentx-plugin 或 .zip 包以扩展 Agent-X。

# Plugin_InstallButton.Text
source: Install Plugin
de: Plugin installieren
es: Instalar Plugin
fr: Installer le plugin
ja: プラグインをインストール
zh_cn: 安装插件

# Plugin_SelectPlugin.Text
source: Select a Plugin
de: Plugin auswählen
es: Seleccionar un Plugin
fr: Sélectionnez un plugin
ja: プラグインを選択
zh_cn: 选择插件

# Plugin_SelectPluginHint.Text
source: Choose a plugin from the left panel to view its details, configuration, and manage its state. Install new plugins using the + button above.
de: Wählen Sie ein Plugin im linken Bereich, um Details, Konfiguration und Status zu verwalten.
es: Elige un plugin del panel izquierdo para ver sus detalles, configuración y gestionar su estado. Instala nuevos plugins con el botón + de arriba.
fr: Choisissez un plugin dans le panneau de gauche pour voir ses détails, sa configuration et gérer son état.
ja: 左パネルからプラグインを選択して、詳細、設定、状態を管理します。
zh_cn: 从左侧面板选择插件以查看详细信息、配置和管理其状态。

# Plugin_Active.OnContent
source: Active
de: Aktiv
es: Activo
fr: Actif
ja: アクティブ
zh_cn: 活跃

# Plugin_Active.OffContent
source: Disabled
de: Deaktiviert
es: Desactivado
fr: Désactivé
ja: 無効
zh_cn: 已禁用

# Plugin_Uninstall.ToolTipService.ToolTip
source: Uninstall this plugin
de: Plugin deinstallieren
es: Desinstalar este plugin
fr: Désinstaller ce plugin
ja: このプラグインをアンインストール
zh_cn: 卸载此插件

# Plugin_Description.Text
source: Description
de: Beschreibung
es: Descripción
ja: 説明
zh_cn: 描述

# Plugin_Details.Text
source: Details
es: Detalles
fr: Détails
ja: 詳細
zh_cn: 详细信息

# Plugin_InstallPath.Text
source: Install Path
de: Installationspfad
es: Ruta de Instalación
fr: Chemin d'installation
ja: インストールパス
zh_cn: 安装路径

# Plugin_Installed.Text
source: Installed
de: Installiert
es: Instalado
fr: Installé
ja: インストール済み
zh_cn: 已安装

# Plugin_LastActivated.Text
source: Last Activated
de: Zuletzt aktiviert
es: Última Activación
fr: Dernière activation
ja: 最終アクティブ化
zh_cn: 最后激活

# Plugin_Configuration.Text
source: Configuration
de: Konfiguration
es: Configuración
ja: 設定
zh_cn: 配置

# Plugin_DangerZone.Text
source: Danger Zone
de: Gefahrenzone
es: Zona de Peligro
fr: Zone de danger
ja: 危険ゾーン
zh_cn: 危险区域

# Plugin_DangerZoneHint.Text
source: Uninstalling a plugin will remove all its files and configuration. This action cannot be undone.
de: Das Deinstallieren entfernt alle Dateien und Konfigurationen. Diese Aktion kann nicht rückgängig gemacht werden.
es: Desinstalar un plugin eliminará todos sus archivos y configuración. Esta acción no se puede deshacer.
fr: La désinstallation supprimera tous les fichiers et la configuration. Cette action est irréversible.
ja: アンインストールするとすべてのファイルと設定が削除されます。この操作は取り消せません。
zh_cn: 卸载插件将删除所有文件和配置。此操作不可撤销。

# Plugin_UninstallButton.Text
source: Uninstall Plugin
de: Plugin deinstallieren
es: Desinstalar Plugin
fr: Désinstaller le plugin
ja: プラグインをアンインストール
zh_cn: 卸载插件

# Plugin_Documentation.Text
source: Documentation
de: Dokumentation
es: Documentación
ja: ドキュメント
zh_cn: 文档

# Plugin_ByAuthor.Text
source: by
de: von
es: por
fr: par
ja: 作者
zh_cn: 作者

# JumpTo_Title.Title
source: Jump To
de: Springen zu
es: Ir a
fr: Accéder à
ja: ジャンプ
zh_cn: 跳转

# Encryption_SectionHeader.Text
source: Database Encryption
de: Datenbankverschlüsselung
es: Cifrado de la base de datos
fr: Chiffrement de la base de données
ja: データベースの暗号化
zh_cn: 数据库加密

# Encryption_Description.Text
source: Encrypt your knowledge vault with AES-256 (SQLCipher). The key is managed automatically and tied to your Windows account.
de: Verschlüsseln Sie Ihren Wissens-Tresor mit AES-256 (SQLCipher). Der Schlüssel wird automatisch verwaltet und ist an Ihr Windows-Konto gebunden.
es: Cifra tu Bóveda de Conocimiento con AES-256 (SQLCipher). La clave se gestiona automáticamente y queda vinculada a tu cuenta de Windows.
fr: Chiffrez votre Coffre-fort de Connaissances avec AES-256 (SQLCipher). La clé est gérée automatiquement et liée à votre compte Windows.
ja: ナレッジ ボールトを AES-256（SQLCipher）で暗号化します。キーは自動的に管理され、お使いの Windows アカウントに紐付けられます。
zh_cn: 使用 AES-256（SQLCipher）加密您的 Knowledge Vault。密钥由系统自动管理，并与您的 Windows 账户绑定。

# UserGuide_PageHeaderTitle.Text
source: USER GUIDE
de: BENUTZERHANDBUCH
es: GUÍA DEL USUARIO
fr: GUIDE DE L'UTILISATEUR
ja: ユーザー ガイド
zh_cn: 用户指南

# UserGuide_PageHeaderDescription.Text
source: Everything you need to know to get the most out of Agent-X.
de: Alles, was Sie wissen müssen, um das Beste aus Agent-X herauszuholen.
es: Todo lo que necesitas saber para sacar el máximo partido a Agent-X.
fr: Tout ce qu'il faut savoir pour tirer le meilleur parti d'Agent-X.
ja: Agent-X を最大限に活用するために知っておくべきすべてをまとめています。
zh_cn: 充分用好 Agent-X 所需了解的一切。

# UserGuide_Welcome_Title.Text
source: Welcome to Agent-X
de: Willkommen bei Agent-X
es: Te damos la bienvenida a Agent-X
fr: Bienvenue dans Agent-X
ja: Agent-X へようこそ
zh_cn: 欢迎使用 Agent-X

# UserGuide_Welcome_Description1.Text
source: Agent-X is a local-first AI workspace for thinking, researching and writing with your own documents. By default it chats with a built-in model that runs on your computer, and it keeps your documents and conversations in a local SQLite database, which you can encrypt from Settings. Nothing leaves your computer unless you choose a cloud AI provider, set up web search or a calendar or email connector, or import pages from the web; the bottom of the Dashboard lists the services that are switched on.
de: Agent-X ist ein Local-First-KI-Arbeitsbereich zum Denken, Recherchieren und Schreiben mit Ihren eigenen Dokumenten. Standardmäßig chattet es mit einem integrierten Modell, das auf Ihrem Computer läuft, und speichert Ihre Dokumente und Unterhaltungen in einer lokalen SQLite-Datenbank, die Sie in den Einstellungen verschlüsseln können. Nichts verlässt Ihren Computer, es sei denn, Sie wählen einen Cloud-KI-Anbieter, richten eine Websuche oder einen Kalender- oder E-Mail-Connector ein oder importieren Seiten aus dem Web; unten im Dashboard sehen Sie, welche Dienste eingeschaltet sind.
es: Agent-X es un espacio de trabajo de IA local-first para pensar, investigar y escribir con sus propios documentos. De forma predeterminada conversa con un modelo integrado que se ejecuta en su equipo, y guarda sus documentos y conversaciones en una base de datos SQLite local que puede cifrar desde Configuración. Nada sale de su equipo a menos que elija un proveedor de IA en la nube, configure la búsqueda web o un conector de calendario o de correo, o importe páginas de la web; la parte inferior del Panel indica qué servicios están activados.
fr: Agent-X est un espace de travail IA local-first pour réfléchir, faire des recherches et écrire à partir de vos propres documents. Par défaut, il converse avec un modèle intégré qui s'exécute sur votre ordinateur et conserve vos documents et conversations dans une base de données SQLite locale, que vous pouvez chiffrer depuis les Paramètres. Rien ne quitte votre ordinateur sauf si vous choisissez un fournisseur d'IA dans le cloud, configurez la recherche web ou un connecteur de calendrier ou d'e-mail, ou importez des pages du web ; le bas du tableau de bord indique les services activés.
ja: Agent-X は、自分のドキュメントを使って考え、調べ、書くためのローカル ファーストの AI ワークスペースです。既定では PC 上で動作する内蔵モデルと会話し、ドキュメントと会話はローカルの SQLite データベースに保存されます。このデータベースは設定から暗号化できます。クラウドの AI プロバイダーを選ぶ、Web 検索やカレンダーまたはメールのコネクタを設定する、Web からページをインポートする、のいずれかを行わない限り、データが PC の外に出ることはありません。有効になっているサービスはダッシュボードの下部に表示されます。
zh_cn: Agent-X 是一个本地优先的 AI 工作区，用于借助您自己的文档进行思考、研究和写作。默认情况下，它使用在您电脑上运行的内置模型进行对话，并将您的文档和对话保存在本地 SQLite 数据库中，您可以在“设置”中为该数据库加密。除非您选择云端 AI 提供商、设置网页搜索或日历、邮件连接器，或从网页导入页面，否则任何数据都不会离开您的电脑；仪表板底部会列出已开启的服务。

# UserGuide_Welcome_Description2.Text
source: In one app you can chat with the built-in model, with models you run in Ollama, or with OpenAI and Anthropic models once you add an API key; ask questions about your own documents and get answers drawn from them (Retrieval-Augmented Generation, RAG); build a Knowledge Vault with automatic tagging, duplicate detection and a Knowledge Graph; search by meaning, by keyword or both (hybrid search merges FTS5 keyword matches and semantic results with Reciprocal Rank Fusion); bring in web pages with the browser extension or Web Import; transcribe audio files; run multi-step Workflows; and extend Agent-X with plugins, calendar and email connectors, and an Android companion app that browses and searches your vault.
de: In einer einzigen App können Sie mit dem integrierten Modell, mit in Ollama ausgeführten Modellen oder, nach Eingabe eines API-Schlüssels, mit Modellen von OpenAI und Anthropic chatten; Fragen zu Ihren eigenen Dokumenten stellen und Antworten erhalten, die auf ihnen beruhen (Retrieval-Augmented Generation, RAG); einen Wissens-Tresor mit automatischer Verschlagwortung, Duplikaterkennung und einem Wissensgraphen aufbauen; nach Bedeutung, nach Stichwörtern oder beidem suchen (die hybride Suche führt FTS5-Stichworttreffer und semantische Ergebnisse per Reciprocal Rank Fusion zusammen); Webseiten mit der Browsererweiterung oder über Web-Import übernehmen; Audiodateien transkribieren; mehrstufige Workflows ausführen; und Agent-X mit Plugins, Kalender- und E-Mail-Connectors sowie einer Android-Begleit-App erweitern, mit der Sie Ihren Tresor durchblättern und durchsuchen.
es: En una sola aplicación puede conversar con el modelo integrado, con modelos que ejecute en Ollama o, tras añadir una clave de API, con modelos de OpenAI y Anthropic; hacer preguntas sobre sus propios documentos y obtener respuestas basadas en ellos (Retrieval-Augmented Generation, RAG); crear una Bóveda de Conocimiento con etiquetado automático, detección de duplicados y un Grafo de conocimiento; buscar por significado, por palabra clave o de ambas formas (la búsqueda híbrida combina las coincidencias de palabras clave de FTS5 y los resultados semánticos mediante Reciprocal Rank Fusion); traer páginas web con la extensión del navegador o con Importación web; transcribir archivos de audio; ejecutar Workflows de varios pasos; y ampliar Agent-X con plugins, conectores de calendario y correo, y una aplicación complementaria para Android que explora y busca en su bóveda.
fr: Dans une seule application, vous pouvez converser avec le modèle intégré, avec des modèles exécutés dans Ollama ou, après avoir ajouté une clé d'API, avec des modèles d'OpenAI et d'Anthropic ; poser des questions sur vos propres documents et obtenir des réponses qui s'appuient sur eux (Retrieval-Augmented Generation, RAG) ; constituer un Coffre-fort de Connaissances avec étiquetage automatique, détection des doublons et Graphe de connaissances ; chercher par le sens, par mots-clés ou les deux (la recherche hybride fusionne les correspondances par mots-clés de FTS5 et les résultats sémantiques par Reciprocal Rank Fusion) ; importer des pages web avec l'extension de navigateur ou Import Web ; transcrire des fichiers audio ; exécuter des Workflows en plusieurs étapes ; et étendre Agent-X avec des plugins, des connecteurs de calendrier et d'e-mail, et une application compagnon Android qui parcourt et interroge votre coffre-fort.
ja: 1 つのアプリで、内蔵モデル、Ollama で実行するモデル、API キーを追加すれば OpenAI や Anthropic のモデルとチャットできます。さらに、自分のドキュメントについて質問してその内容に基づく回答を得る (検索拡張生成、RAG)、自動タグ付け、重複検出、ナレッジ グラフを備えた Knowledge Vault を作る、意味、キーワード、またはその両方で検索する (ハイブリッド検索は FTS5 のキーワード一致とセマンティック検索の結果を Reciprocal Rank Fusion で統合します)、ブラウザー拡張機能や Web インポートで Web ページを取り込む、音声ファイルを文字起こしする、複数ステップのワークフローを実行する、そしてプラグイン、カレンダーとメールのコネクタ、Vault を閲覧、検索できる Android コンパニオン アプリで Agent-X を拡張する、といったことができます。
zh_cn: 在一个应用中，您可以与内置模型、在 Ollama 中运行的模型，或在添加 API 密钥后与 OpenAI 和 Anthropic 的模型对话；就您自己的文档提问，并获得基于文档内容的回答（检索增强生成，RAG）；构建带有自动标记、重复检测和知识图谱的 Knowledge Vault；按含义、关键词或两者结合进行搜索（混合搜索通过 Reciprocal Rank Fusion 合并 FTS5 关键词匹配和语义结果）；使用浏览器扩展或网页导入获取网页；转录音频文件；运行多步骤工作流；并通过插件、日历和邮件连接器，以及可浏览和搜索 Vault 的 Android 配套应用来扩展 Agent-X。

# UserGuide_Welcome_Description3.Text
source: This guide walks through the pages of Agent-X in one scrolling column. To get somewhere fast from anywhere in the app, press Ctrl+K for the Command Palette (pages and a few actions) or Ctrl+P for Jump To (pages, documents and conversations).
de: Dieses Handbuch stellt die Seiten von Agent-X in einer durchgehend scrollbaren Spalte vor. Um von überall in der App schnell ans Ziel zu kommen, drücken Sie Strg+K für die Befehlspalette (Seiten und einige Aktionen) oder Strg+P für „Springen zu“ (Seiten, Dokumente und Unterhaltungen).
es: Esta guía recorre las páginas de Agent-X en una sola columna desplazable. Para llegar rápido a donde quiera desde cualquier parte de la aplicación, pulse Ctrl+K para abrir la paleta de comandos (páginas y algunas acciones) o Ctrl+P para Ir a (páginas, documentos y conversaciones).
fr: Ce guide présente les pages d'Agent-X dans une seule colonne que l'on fait défiler. Pour aller vite où vous voulez depuis n'importe quel endroit de l'application, appuyez sur Ctrl+K pour la palette de commandes (pages et quelques actions) ou sur Ctrl+P pour Accéder à (pages, documents et conversations).
ja: このガイドでは、Agent-X の各ページを 1 列のスクロールで順に説明します。アプリのどこからでもすばやく移動するには、Ctrl+K でコマンド パレット (ページといくつかの操作)、Ctrl+P で [ジャンプ] (ページ、ドキュメント、会話) を開きます。
zh_cn: 本指南在一个可滚动的单列中介绍 Agent-X 的各个页面。要在应用中的任何位置快速跳转，请按 Ctrl+K 打开命令面板（页面和少量操作），或按 Ctrl+P 打开“跳转”（页面、文档和对话）。

# UserGuide_GettingStarted_Title.Text
source: Getting Started
de: Erste Schritte
es: Primeros pasos
fr: Premiers pas
ja: はじめに
zh_cn: 快速上手

# UserGuide_GettingStarted_Prerequisites_Title.Text
source: Prerequisites
de: Voraussetzungen
es: Requisitos previos
fr: Prérequis
ja: 前提条件
zh_cn: 前置条件

# UserGuide_GettingStarted_Prereq1.Text
source: Install Ollama (optional) - Agent-X uses its built-in local model by default, so you need Ollama only if you want to run other open models on your computer. Download it from ollama.com. OpenAI and Anthropic need only an API key.
de: Ollama installieren (optional) - Agent-X verwendet standardmäßig sein integriertes lokales Modell; Ollama brauchen Sie nur, wenn Sie weitere offene Modelle auf Ihrem Computer ausführen möchten. Laden Sie es von ollama.com herunter. Für OpenAI und Anthropic genügt ein API-Schlüssel.
es: Instale Ollama (opcional) - Agent-X usa de forma predeterminada su modelo local integrado, así que solo necesita Ollama si quiere ejecutar otros modelos abiertos en su equipo. Descárguelo desde ollama.com. OpenAI y Anthropic solo necesitan una clave de API.
fr: Installer Ollama (facultatif) - Agent-X utilise par défaut son modèle local intégré ; Ollama n'est utile que si vous voulez exécuter d'autres modèles ouverts sur votre ordinateur. Téléchargez-le sur ollama.com. OpenAI et Anthropic n'ont besoin que d'une clé d'API.
ja: Ollama のインストール (任意)：Agent-X は既定で内蔵のローカル モデルを使うため、Ollama が必要なのは PC 上で他のオープン モデルを実行したい場合だけです。ollama.com からダウンロードしてください。OpenAI と Anthropic に必要なのは API キーだけです。
zh_cn: 安装 Ollama（可选）：Agent-X 默认使用内置的本地模型，只有当您想在电脑上运行其他开放模型时才需要 Ollama。可从 ollama.com 下载。OpenAI 和 Anthropic 只需要 API 密钥。

# UserGuide_GettingStarted_Prereq2_Title.Text
source: Pull at least one chat model — Open a terminal and run
de: Mindestens ein Chat-Modell laden — Öffnen Sie ein Terminal und führen Sie aus
es: Descargue al menos un modelo de chat: abra una terminal y ejecute
fr: Téléchargez au moins un modèle de chat — Ouvrez un terminal et exécutez
ja: チャットモデルを少なくとも 1 つ取得 — ターミナルを開いて次を実行します
zh_cn: 至少拉取一个聊天模型 —— 打开终端并运行

# UserGuide_GettingStarted_Prereq2_Description.Text
source: llama3.2 is a good general-purpose chat model and runs well with 8 GB of VRAM. Indexing, Semantic Search and Ask Your Files also need embeddings: with the default Embedding Model setting (all-minilm), Agent-X uses its built-in model when that model is installed and otherwise asks Ollama for all-minilm, a small embedding model (about 46 MB) that you pull with:
de: llama3.2 ist ein gutes Allzweck-Chatmodell und läuft gut mit 8 GB VRAM. Indexierung, Semantische Suche und „Fragen Sie Ihre Dateien“ benötigen außerdem Embeddings: Mit der Standardeinstellung für das Embedding-Modell (all-minilm) verwendet Agent-X sein integriertes Modell, sofern es installiert ist, und fragt andernfalls bei Ollama all-minilm an, ein kleines Embedding-Modell (etwa 46 MB), das Sie so laden:
es: llama3.2 es un buen modelo de chat de uso general y funciona bien con 8 GB de VRAM. La indexación, la Búsqueda semántica y Pregunta a tus archivos también necesitan embeddings: con el ajuste predeterminado de Modelo de embeddings (all-minilm), Agent-X usa su modelo integrado cuando está instalado y, si no, pide a Ollama all-minilm, un modelo de embeddings pequeño (unos 46 MB) que se descarga con:
fr: llama3.2 est un bon modèle de conversation généraliste et fonctionne bien avec 8 Go de VRAM. L'indexation, la Recherche sémantique et Interroger vos fichiers ont aussi besoin d'embeddings : avec le réglage par défaut du modèle d'embeddings (all-minilm), Agent-X utilise son modèle intégré s'il est installé, et sinon demande à Ollama all-minilm, un petit modèle d'embeddings (environ 46 Mo) que vous récupérez avec :
ja: llama3.2 は汎用のチャット モデルとして優れており、VRAM 8 GB でも快適に動作します。インデックス作成、セマンティック検索、「ファイルに質問する」には埋め込みも必要です。埋め込みモデルの設定が既定 (all-minilm) のままの場合、Agent-X は内蔵モデルがインストールされていればそれを使い、なければ Ollama に all-minilm を要求します。all-minilm は小さな埋め込みモデル (約 46 MB) で、次のコマンドで取得します：
zh_cn: llama3.2 是一款出色的通用聊天模型，在 8 GB 显存上运行良好。索引、语义搜索和“向您的文件提问”还需要嵌入：在嵌入模型设置保持默认值（all-minilm）时，如果已安装内置模型，Agent-X 会使用它，否则会向 Ollama 请求 all-minilm。all-minilm 是一个小型嵌入模型（约 46 MB），可以用以下命令拉取：

# UserGuide_GettingStarted_Prereq3_Title.Text
source: Keep Ollama running - When Agent-X uses Ollama, Ollama must be serving on http://localhost:11434 (the default address). If it is not already running in the background, start it with
de: Ollama laufen lassen - Wenn Agent-X Ollama verwendet, muss Ollama unter http://localhost:11434 (der Standardadresse) bereitstehen. Falls es nicht bereits im Hintergrund läuft, starten Sie es mit
es: Mantenga Ollama en ejecución - Cuando Agent-X usa Ollama, Ollama debe estar atendiendo en http://localhost:11434 (la dirección predeterminada). Si todavía no se ejecuta en segundo plano, inícielo con
fr: Laisser Ollama tourner - Quand Agent-X utilise Ollama, Ollama doit être à l'écoute sur http://localhost:11434 (l'adresse par défaut). S'il ne tourne pas déjà en arrière-plan, lancez-le avec
ja: Ollama を起動しておく：Agent-X が Ollama を使う場合、Ollama は http://localhost:11434 (既定のアドレス) で待ち受けている必要があります。バックグラウンドでまだ実行されていない場合は、次のコマンドで起動します
zh_cn: 保持 Ollama 运行：当 Agent-X 使用 Ollama 时，Ollama 必须在 http://localhost:11434（默认地址）上提供服务。如果它尚未在后台运行，请使用以下命令启动

# UserGuide_GettingStarted_FirstLaunch_Title.Text
source: First Launch & Onboarding
de: Erster Start & Onboarding
es: Primer arranque y configuración inicial
fr: Premier lancement et intégration
ja: 初回起動とオンボーディング
zh_cn: 首次启动与初始引导

# UserGuide_GettingStarted_FirstLaunch_Description.Text
source: The first time you open Agent-X the Onboarding wizard takes over. It tests the connection to your Ollama endpoint (you can skip this step), lists your locally installed Ollama models so you can pick a default chat model and a default embedding model, checks the built-in local model and your GPU acceleration (and offers to download the model if your installer did not include it), and takes optional OpenAI and Anthropic API keys before a final summary. You import documents afterwards, from the Knowledge Vault.
de: Beim ersten Start von Agent-X übernimmt der Onboarding-Assistent. Er prüft die Verbindung zu Ihrem Ollama-Endpunkt (dieser Schritt lässt sich überspringen), listet Ihre lokal installierten Ollama-Modelle auf, damit Sie ein Standard-Chatmodell und ein Standard-Embedding-Modell wählen können, prüft das integrierte lokale Modell und die GPU-Beschleunigung (und bietet den Download des Modells an, falls Ihr Installer es nicht enthielt) und nimmt optional OpenAI- und Anthropic-API-Schlüssel entgegen, bevor eine abschließende Zusammenfassung erscheint. Dokumente importieren Sie danach im Wissens-Tresor.
es: La primera vez que abre Agent-X, el asistente de incorporación toma el control. Comprueba la conexión con su endpoint de Ollama (puede omitir este paso), enumera los modelos de Ollama instalados localmente para que elija un modelo de chat y un modelo de embeddings predeterminados, comprueba el modelo local integrado y la aceleración por GPU (y ofrece descargar el modelo si su instalador no lo incluía) y recoge claves de API opcionales de OpenAI y Anthropic antes de un resumen final. Los documentos se importan después, desde la Bóveda de Conocimiento.
fr: Au premier lancement d'Agent-X, l'assistant d'intégration prend la main. Il teste la connexion à votre point de terminaison Ollama (vous pouvez passer cette étape), liste vos modèles Ollama installés localement pour que vous choisissiez un modèle de chat et un modèle d'embedding par défaut, vérifie le modèle local intégré et l'accélération GPU (et propose de télécharger le modèle si votre installateur ne l'incluait pas), puis recueille des clés d'API OpenAI et Anthropic facultatives avant un récapitulatif final. Vous importez ensuite vos documents depuis le Coffre-fort de Connaissances.
ja: Agent-X を初めて開くと、オンボーディング ウィザードが起動します。Ollama エンドポイントへの接続をテストし (この手順はスキップできます)、ローカルにインストールされた Ollama モデルを一覧表示して既定のチャット モデルと埋め込みモデルを選べるようにし、内蔵ローカル モデルと GPU アクセラレーションを確認し (インストーラーにモデルが含まれていなかった場合はダウンロードを提案します)、最後の概要の前に任意で OpenAI と Anthropic の API キーを受け付けます。ドキュメントのインポートはその後、Knowledge Vault から行います。
zh_cn: 首次打开 Agent-X 时，初始引导向导会接管界面。它会测试与 Ollama 端点的连接（此步骤可跳过），列出本地已安装的 Ollama 模型供您选择默认聊天模型和默认嵌入模型，检查内置本地模型和 GPU 加速（如果安装程序未包含该模型，会提供下载），并在最终摘要之前接收可选的 OpenAI 和 Anthropic API 密钥。文档随后在 Knowledge Vault 中导入。
